name: "indicxlit_postprocess"
backend: "python"
max_batch_size: 256

dynamic_batching {
  preferred_batch_size: [ 32, 64, 128, 256 ]
  max_queue_delay_microseconds: 3000
}

input [
  { name: "TOKENS_BATCH" data_type: TYPE_INT32 dims: [ -1, -1 ] },
  { name: "SEQUENCE_LENGTH" data_type: TYPE_INT32 dims: [ -1 ] },
  { name: "CUM_LOG_PROBS" data_type: TYPE_FP32 dims: [ -1 ] optional: true },
  { name: "TARGET_LANG" data_type: TYPE_STRING dims: [ 1 ] },
  { name: "TOPK" data_type: TYPE_INT32 dims: [ 1 ] optional: true },
  { name: "RESCORE" data_type: TYPE_BOOL dims: [ 1 ] optional: true }
]

output [
  { name: "TEXT_OUTPUT" data_type: TYPE_STRING dims: [ 1 ] },
  { name: "CANDIDATES_JSON" data_type: TYPE_STRING dims: [ 1 ] }
]

instance_group [
  { count: 1 kind: KIND_CPU }
]

parameters {
  key: "model_root"
  value: { string_value: "/models/assets/en2indic" }
}
parameters {
  key: "default_lang"
  value: { string_value: "hi" }
}
parameters {
  key: "strip_decoder_prompt_len"
  value: { string_value: "0" }
}
